.docker/artillery/script.yaml
config:
  target: 'http://app:3000'
  phases:
    - duration: 60
      arrivalRate: 100000
scenarios:
  - name: 'Say hello!'
    flow:
      - get:
          url: '/'
          expect:
            - statusCode: 200
  - name: 'Check health'
    flow:
      - get:
          url: '/health'
          expect:
            - statusCode: 200
  - name: 'Get Schools'
    flow:
      - post:
          url: '/rpc.get_all_school'
          json:
            page: 0,
            per_page: 10
          headers:
            Content-Type: 'application/json'
          expect:
            - statusCode: 200